Repository: fadak9999/graduation_project_99
Catalog: lib/l10n/intl_*.arb
Languages: ar

# titllehome
source: Sections
ar: اقسام

source: Chatbot
ar: محادثة

# text_to_imag
source: Image To Text
ar: استخراج النص من الصوة

source: Text To Speech
ar: تحويل النص الى كلام

source: Speech To Text
ar: تحويل الكلام الى نص

source: Choose an Image
ar: اختر صورة

source: Language
ar: اللغة

# Enter
source: Enter text to speak
ar: أدخل النص للتحدث

source: Speak
ar: تحدث

# press_mic_to_speak
source: Press the microphone to speak...
ar: اضغط على الميكروفون للتحدث...

# speech_not_initialized
source: Speech recognition is not initialized properly.
ar: التعرف على الصوت غير مهيأ بشكل صحيح.

# speech_will_appear_here
source: Your speech will appear here...
ar: سيظهر النص المنطوق هنا...

source: Listening now...
ar: يتم الاستماع الآن...

# microphone_permission_required
source: Microphone permission is required to use this feature.
ar: يجب السماح باستخدام الميكروفون لاستخدام هذه الميزة.
